# LineLightShape Class

---
This class encapsulates a line light shape.
SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingLineLightShape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LineLightShape : LightShape

    Public Class LineLightShape
    	Inherits LightShape

    public ref class LineLightShape : public LightShape

    type LineLightShape =
        class
            inherit LightShape
        end
The LineLightShape type exposes the following members.
| Name| Description
---|---|---
| LineLightShape|  Creates a line light shape object with 2.0' emit length.
| LineLightShape(Double)|  Creates a line light shape object with the given emit length.
| LineLightShape(LineLightShape)|  Creates a copy of the given line light shape
Top
| Name| Description
---|---|---
| EmitLength|  The emit length.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightShape derived object. (Inherited from LightShape)
| Dispose| (Inherited from LightShape)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace